cfm_webservice_la/src/test/resources/la_recv_send.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
				xmlns:drn="http://www.csc.smart/bo/schemas/DRNADDI" 
				xmlns:msp="http://www.csc.smart/msp/schemas/MSPContext">
	<soapenv:Header/>
	<soapenv:Body>
		<drn:DRNADDI_REC>
			<!--Optional:-->
			<msp:MSPContext>
				<!--Optional:-->
				<!--Optional:-->
				<msp:UserId>WANGBB</msp:UserId>
				<!--Optional:-->
				<msp:UserPassword>USER600</msp:UserPassword>
				<msp:RequestParameters>
					<!--Zero or more repetitions:-->
					<msp:RequestParameter name="BRANCH" value="SH"/>
				</msp:RequestParameters>
			</msp:MSPContext>
			<ADDITIONAL_FIELDS>
				<!--1 to 50 repetitions:-->
				<DRNINRECS>
					<COMPANY>1</COMPANY>
					<BRANCH>SH</BRANCH>
					<COWNSEL>76337718</COWNSEL>
					<PAYTYPE>C</PAYTYPE>
					<TCHQDATE>01032019</TCHQDATE>
					<DOCORIGAMT>200</DOCORIGAMT>
					<BANKACCKEY>622238131313</BANKACCKEY>
					<ZNBNKKEY>BOC</ZNBNKKEY>
					<BANKDESC>73631713</BANKDESC>
					<BANKACCDSC>WANGBOBO</BANKACCDSC>
					<JOBNO>1</JOBNO>
					<TRANCD>B521</TRANCD>
					<BANKCODE>S1</BANKCODE>
					<SACSCODE>LP</SACSCODE>
					<SACSTYPE>S</SACSTYPE>
					<NEXTDATE>01032019</NEXTDATE>
					<ZNSTAT>01</ZNSTAT>
					<TXTLINE>FY</TXTLINE>
					<DDDEREF>444131311</DDDEREF>
				</DRNINRECS>
			</ADDITIONAL_FIELDS>
		</drn:DRNADDI_REC>
	</soapenv:Body>
</soapenv:Envelope>